app/controllers/tweets_controller.rb

   def create
     @tweet = Tweet.new(params[:tweet])

     respond_to do |format|
       if @tweet.save
---
INSERT INTO `tweets` (`created_on`, `text`, `user`) VALUES('2009-11-23 20:45:30', 'I\'m developing in ruby on rails.', 'Jorge Zapico')